MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECM144/mcu.h
  .extern C2FIFOCI30INV    /* 0xBF881B0C */
  .extern C2FIFOCON31      /* 0xBF881B10 */
  .extern C2FIFOCON31CLR   /* 0xBF881B14 */
  .extern C2FIFOCON31SET   /* 0xBF881B18 */
  .extern C2FIFOCON31INV   /* 0xBF881B1C */
  .extern C2FIFOINT31      /* 0xBF881B20 */
  .extern C2FIFOINT31CLR   /* 0xBF881B24 */
  .extern C2FIFOINT31SET   /* 0xBF881B28 */
  .extern C2FIFOINT31INV   /* 0xBF881B2C */
  .extern C2FIFOUA31       /* 0xBF881B30 */
  .extern C2FIFOUA31CLR    /* 0xBF881B34 */
  .extern C2FIFOUA31SET    /* 0xBF881B38 */
  .extern C2FIFOUA31INV    /* 0xBF881B3C */
  .extern C2FIFOCI31       /* 0xBF881B40 */
  .extern C2FIFOCI31CLR    /* 0xBF881B44 */
  .extern C2FIFOCI31SET    /* 0xBF881B48 */
  .extern C2FIFOCI31INV    /* 0xBF881B4C */
  .extern ETHCON1          /* 0xBF882000 */
  .extern ETHCON1CLR       /* 0xBF882004 */
  .extern ETHCON1SET       /* 0xBF882008 */
  .extern ETHCON1INV       /* 0xBF88200C */
  .extern ETHCON2          /* 0xBF882010 */
  .extern ETHCON2CLR       /* 0xBF882014 */
  .extern ETHCON2SET       /* 0xBF882018 */
  .extern ETHCON2INV       /* 0xBF88201C */
  .extern ETHTXST          /* 0xBF882020 */
  .extern ETHTXSTCLR       /* 0xBF882024 */
  .extern ETHTXSTSET       /* 0xBF882028 */
  .extern ETHTXSTINV       /* 0xBF88202C */
  .extern ETHRXST          /* 0xBF882030 */
  .extern ETHRXSTCLR       /* 0xBF882034 */
  .extern ETHRXSTSET       /* 0xBF882038 */
  .extern ETHRXSTINV       /* 0xBF88203C */
  .extern ETHHT0           /* 0xBF882040 */
  .extern ETHHT0CLR        /* 0xBF882044 */
  .extern ETHHT0SET        /* 0xBF882048 */
  .extern ETHHT0INV        /* 0xBF88204C */
  .extern ETHHT1           /* 0xBF882050 */
  .extern ETHHT1CLR        /* 0xBF882054 */
  .extern ETHHT1SET        /* 0xBF882058 */
  .extern ETHHT1INV        /* 0xBF88205C */
  .extern ETHPMM0          /* 0xBF882060 */
  .extern ETHPMM0CLR       /* 0xBF882064 */
  .extern ETHPMM0SET       /* 0xBF882068 */
  .extern ETHPMM0INV       /* 0xBF88206C */
  .extern ETHPMM1          /* 0xBF882070 */
  .extern ETHPMM1CLR       /* 0xBF882074 */
  .extern ETHPMM1SET       /* 0xBF882078 */
  .extern ETHPMM1INV       /* 0xBF88207C */
  .extern ETHPMCS          /* 0xBF882080 */
  .extern ETHPMCSCLR       /* 0xBF882084 */
  .extern ETHPMCSSET       /* 0xBF882088 */
  .extern ETHPMCSINV       /* 0xBF88208C */
  .extern ETHPMO           /* 0xBF882090 */
  .extern ETHPMOCLR        /* 0xBF882094 */
  .extern ETHPMOSET        /* 0xBF882098 */
  .extern ETHPMOINV        /* 0xBF88209C */
  .extern ETHRXFC          /* 0xBF8820A0 */
  .extern ETHRXFCCLR       /* 0xBF8820A4 */
  .extern ETHRXFCSET       /* 0xBF8820A8 */
  .extern ETHRXFCINV       /* 0xBF8820AC */
  .extern ETHRXWM          /* 0xBF8820B0 */
  .extern ETHRXWMCLR       /* 0xBF8820B4 */
  .extern ETHRXWMSET       /* 0xBF8820B8 */
  .extern ETHRXWMINV       /* 0xBF8820BC */
  .extern ETHIEN           /* 0xBF8820C0 */
  .extern ETHIENCLR        /* 0xBF8820C4 */
  .extern ETHIENSET        /* 0xBF8820C8 */
  .extern ETHIENINV        /* 0xBF8820CC */
  .extern ETHIRQ           /* 0xBF8820D0 */
  .extern ETHIRQCLR        /* 0xBF8820D4 */
  .extern ETHIRQSET        /* 0xBF8820D8 */
  .extern ETHIRQINV        /* 0xBF8820DC */
  .extern ETHSTAT          /* 0xBF8820E0 */
  .extern ETHSTATCLR       /* 0xBF8820E4 */
  .extern ETHSTATSET       /* 0xBF8820E8 */
  .extern ETHSTATINV       /* 0xBF8820EC */
  .extern ETHRXOVFLOW      /* 0xBF882100 */
  .extern ETHRXOVFLOWCLR   /* 0xBF882104 */
  .extern ETHRXOVFLOWSET   /* 0xBF882108 */
  .extern ETHRXOVFLOWINV   /* 0xBF88210C */
  .extern ETHFRMTXOK       /* 0xBF882110 */
  .extern ETHFRMTXOKCLR    /* 0xBF882114 */
  .extern ETHFRMTXOKSET    /* 0xBF882118 */
  .extern ETHFRMTXOKINV    /* 0xBF88211C */
  .extern ETHSCOLFRM       /* 0xBF882120 */
  .extern ETHSCOLFRMCLR    /* 0xBF882124 */
  .extern ETHSCOLFRMSET    /* 0xBF882128 */
  .extern ETHSCOLFRMINV    /* 0xBF88212C */
  .extern ETHMCOLFRM       /* 0xBF882130 */
  .extern ETHMCOLFRMCLR    /* 0xBF882134 */
  .extern ETHMCOLFRMSET    /* 0xBF882138 */
  .extern ETHMCOLFRMINV    /* 0xBF88213C */
  .extern ETHFRMRXOK       /* 0xBF882140 */
  .extern ETHFRMRXOKCLR    /* 0xBF882144 */
  .extern ETHFRMRXOKSET    /* 0xBF882148 */
  .extern ETHFRMRXOKINV    /* 0xBF88214C */
  .extern ETHFCSERR        /* 0xBF882150 */
  .extern ETHFCSERRCLR     /* 0xBF882154 */
  .extern ETHFCSERRSET     /* 0xBF882158 */
  .extern ETHFCSERRINV     /* 0xBF88215C */
  .extern ETHALGNERR       /* 0xBF882160 */
  .extern ETHALGNERRCLR    /* 0xBF882164 */
  .extern ETHALGNERRSET    /* 0xBF882168 */
  .extern ETHALGNERRINV    /* 0xBF88216C */
  .extern EMAC1CFG1        /* 0xBF882200 */
  .extern EMACxCFG1        /* 0xBF882200 */
  .extern EMAC1CFG1CLR     /* 0xBF882204 */
  .extern EMACxCFG1CLR     /* 0xBF882204 */
  .extern EMAC1CFG1SET     /* 0xBF882208 */
  .extern EMACxCFG1SET     /* 0xBF882208 */
  .extern EMAC1CFG1INV     /* 0xBF88220C */
  .extern EMACxCFG1INV     /* 0xBF88220C */
  .extern EMAC1CFG2        /* 0xBF882210 */
  .extern EMACxCFG2        /* 0xBF882210 */
  .extern EMAC1CFG2CLR     /* 0xBF882214 */
  .extern EMACxCFG2CLR     /* 0xBF882214 */
  .extern EMAC1CFG2SET     /* 0xBF882218 */
  .extern EMACxCFG2SET     /* 0xBF882218 */
  .extern EMAC1CFG2INV     /* 0xBF88221C */
  .extern EMACxCFG2INV     /* 0xBF88221C */
  .extern EMAC1IPGT        /* 0xBF882220 */
  .extern EMACxIPGT        /* 0xBF882220 */
  .extern EMAC1IPGTCLR     /* 0xBF882224 */
  .extern EMACxIPGTCLR     /* 0xBF882224 */
  .extern EMAC1IPGTSET     /* 0xBF882228 */
  .extern EMACxIPGTSET     /* 0xBF882228 */
  .extern EMAC1IPGTINV     /* 0xBF88222C */
  .extern EMACxIPGTINV     /* 0xBF88222C */
  .extern EMAC1IPGR        /* 0xBF882230 */
  .extern EMACxIPGR        /* 0xBF882230 */
  .extern EMAC1IPGRCLR     /* 0xBF882234 */
  .extern EMACxIPGRCLR     /* 0xBF882234 */
  .extern EMAC1IPGRSET     /* 0xBF882238 */
  .extern EMACxIPGRSET     /* 0xBF882238 */
  .extern EMAC1IPGRINV     /* 0xBF88223C */
  .extern EMACxIPGRINV     /* 0xBF88223C */
  .extern EMAC1CLRT        /* 0xBF882240 */
  .extern EMACxCLRT        /* 0xBF882240 */
  .extern EMAC1CLRTCLR     /* 0xBF882244 */
  .extern EMACxCLRTCLR     /* 0xBF882244 */
  .extern EMAC1CLRTSET     /* 0xBF882248 */
  .extern EMACxCLRTSET     /* 0xBF882248 */
  .extern EMAC1CLRTINV     /* 0xBF88224C */
  .extern EMACxCLRTINV     /* 0xBF88224C */
  .extern EMAC1MAXF        /* 0xBF882250 */
  .extern EMACxMAXF        /* 0xBF882250 */
  .extern EMAC1MAXFCLR     /* 0xBF882254 */
  .extern EMACxMAXFCLR     /* 0xBF882254 */
  .extern EMAC1MAXFSET     /* 0xBF882258 */
  .extern EMACxMAXFSET     /* 0xBF882258 */
  .extern EMAC1MAXFINV     /* 0xBF88225C */
  .extern EMACxMAXFINV     /* 0xBF88225C */
  .extern EMAC1SUPP        /* 0xBF882260 */
  .extern EMACxSUPP        /* 0xBF882260 */
  .extern EMAC1SUPPCLR     /* 0xBF882264 */
  .extern EMACxSUPPCLR     /* 0xBF882264 */
  .extern EMAC1SUPPSET     /* 0xBF882268 */
  .extern EMACxSUPPSET     /* 0xBF882268 */
  .extern EMAC1SUPPINV     /* 0xBF88226C */
  .extern EMACxSUPPINV     /* 0xBF88226C */
  .extern EMAC1TEST        /* 0xBF882270 */
  .extern EMACxTEST        /* 0xBF882270 */
  .extern EMAC1TESTCLR     /* 0xBF882274 */
  .extern EMACxTESTCLR     /* 0xBF882274 */
  .extern EMAC1TESTSET     /* 0xBF882278 */
  .extern EMACxTESTSET     /* 0xBF882278 */
  .extern EMAC1TESTINV     /* 0xBF88227C */
  .extern EMACxTESTINV     /* 0xBF88227C */
  .extern EMAC1MCFG        /* 0xBF882280 */
  .extern EMACxMCFG        /* 0xBF882280 */
  .extern EMAC1MCFGCLR     /* 0xBF882284 */
  .extern EMACxMCFGCLR     /* 0xBF882284 */
  .extern EMAC1MCFGSET     /* 0xBF882288 */
  .extern EMACxMCFGSET     /* 0xBF882288 */
  .extern EMAC1MCFGINV     /* 0xBF88228C */
  .extern EMACxMCFGINV     /* 0xBF88228C */
  .extern EMAC1MCMD        /* 0xBF882290 */
  .extern EMACxMCMD        /* 0xBF882290 */
  .extern EMAC1MCMDCLR     /* 0xBF882294 */
  .extern EMACxMCMDCLR     /* 0xBF882294 */
  .extern EMAC1MCMDSET     /* 0xBF882298 */
  .extern EMACxMCMDSET     /* 0xBF882298 */
  .extern EMAC1MCMDINV     /* 0xBF88229C */
  .extern EMACxMCMDINV     /* 0xBF88229C */
  .extern EMAC1MADR        /* 0xBF8822A0 */
  .extern EMACxMADR        /* 0xBF8822A0 */
  .extern EMAC1MADRCLR     /* 0xBF8822A4 */
  .extern EMACxMADRCLR     /* 0xBF8822A4 */
  .extern EMAC1MADRSET     /* 0xBF8822A8 */
  .extern EMACxMADRSET     /* 0xBF8822A8 */
  .extern EMAC1MADRINV     /* 0xBF8822AC */
  .extern EMACxMADRINV     /* 0xBF8822AC */
  .extern EMAC1MWTD        /* 0xBF8822B0 */
  .extern EMACxMWTD        /* 0xBF8822B0 */
  .extern EMAC1MWTDCLR     /* 0xBF8822B4 */
  .extern EMACxMWTDCLR     /* 0xBF8822B4 */
  .extern EMAC1MWTDSET     /* 0xBF8822B8 */
  .extern EMACxMWTDSET     /* 0xBF8822B8 */
  .extern EMAC1MWTDINV     /* 0xBF8822BC */
  .extern EMACxMWTDINV     /* 0xBF8822BC */
  .extern EMAC1MRDD        /* 0xBF8822C0 */
  .extern EMACxMRDD        /* 0xBF8822C0 */
  .extern EMAC1MRDDCLR     /* 0xBF8822C4 */
  .extern EMACxMRDDCLR     /* 0xBF8822C4 */
  .extern EMAC1MRDDSET     /* 0xBF8822C8 */
  .extern EMACxMRDDSET     /* 0xBF8822C8 */
  .extern EMAC1MRDDINV     /* 0xBF8822CC */
  .extern EMACxMRDDINV     /* 0xBF8822CC */
  .extern EMAC1MIND        /* 0xBF8822D0 */
  .extern EMACxMIND        /* 0xBF8822D0 */
  .extern EMAC1MINDCLR     /* 0xBF8822D4 */
  .extern EMACxMINDCLR     /* 0xBF8822D4 */
  .extern EMAC1MINDSET     /* 0xBF8822D8 */
  .extern EMACxMINDSET     /* 0xBF8822D8 */
  .extern EMAC1MINDINV     /* 0xBF8822DC */
  .extern EMACxMINDINV     /* 0xBF8822DC */
  .extern EMAC1SA0         /* 0xBF882300 */
  .extern EMACxSA0         /* 0xBF882300 */
  .extern EMAC1SA0CLR      /* 0xBF882304 */
  .extern EMACxSA0CLR      /* 0xBF882304 */
  .extern EMAC1SA0SET      /* 0xBF882308 */
  .extern EMACxSA0SET      /* 0xBF882308 */
  .extern EMAC1SA0INV      /* 0xBF88230C */
  .extern EMACxSA0INV      /* 0xBF88230C */
  .extern EMAC1SA1         /* 0xBF882310 */
  .extern EMACxSA1         /* 0xBF882310 */
  .extern EMAC1SA1CLR      /* 0xBF882314 */
  .extern EMACxSA1CLR      /* 0xBF882314 */
  .extern EMAC1SA1SET      /* 0xBF882318 */
  .extern EMACxSA1SET      /* 0xBF882318 */
  .extern EMAC1SA1INV      /* 0xBF88231C */
  .extern EMACxSA1INV      /* 0xBF88231C */
  .extern EMAC1SA2         /* 0xBF882320 */
  .extern EMACxSA2         /* 0xBF882320 */
  .extern EMAC1SA2CLR      /* 0xBF882324 */
  .extern EMACxSA2CLR      /* 0xBF882324 */
  .extern EMAC1SA2SET      /* 0xBF882328 */
  .extern EMACxSA2SET      /* 0xBF882328 */
  .extern EMAC1SA2INV      /* 0xBF88232C */
  .extern EMACxSA2INV      /* 0xBF88232C */
  .extern PRECON           /* 0xBF8E0000 */
  .extern PRECONCLR        /* 0xBF8E0004 */
  .extern PRECONSET        /* 0xBF8E0008 */
  .extern PRECONINV        /* 0xBF8E000C */
  .extern PRESTAT          /* 0xBF8E0010 */
  .extern PRESTATCLR       /* 0xBF8E0014 */
  .extern PRESTATSET       /* 0xBF8E0018 */
  .extern PRESTATINV       /* 0xBF8E001C */
  .extern EBICS0           /* 0xBF8E1014 */
  .extern EBICS1           /* 0xBF8E1018 */
  .extern EBICS2           /* 0xBF8E101C */
  .extern EBICS3           /* 0xBF8E1020 */
  .extern EBIMSK0          /* 0xBF8E1054 */
  .extern EBIMSK1          /* 0xBF8E1058 */
  .extern EBIMSK2          /* 0xBF8E105C */
  .extern EBIMSK3          /* 0xBF8E1060 */
  .extern EBISMT0          /* 0xBF8E1094 */
  .extern EBISMT1          /* 0xBF8E1098 */
  .extern EBISMT2          /* 0xBF8E109C */
  .extern EBIFTRPD         /* 0xBF8E10A0 */
  .extern EBISMCON         /* 0xBF8E10A4 */
  .extern SQI1XCON1        /* 0xBF8E2000 */
  .extern SQI1XCON2        /* 0xBF8E2004 */
  .extern SQI1CFG          /* 0xBF8E2008 */
  .extern SQI1CON          /* 0xBF8E200C */
  .extern SQI1CLKCON       /* 0xBF8E2010 */
  .extern SQI1CMDTHR       /* 0xBF8E2014 */
  .extern SQI1INTTHR       /* 0xBF8E2018 */
  .extern SQI1INTEN        /* 0xBF8E201C */
  .extern SQI1INTSTAT      /* 0xBF8E2020 */
  .extern SQI1TXBUF        /* 0xBF8E2024 */
  .extern SQI1RXBUF        /* 0xBF8E2028 */
  .extern SQI1STAT1        /* 0xBF8E202C */
  .extern SQI1STAT2        /* 0xBF8E2030 */
  .extern SQI1BDCON        /* 0xBF8E2034 */
  .extern SQI1BDCURADD     /* 0xBF8E2038 */
  .extern SQI1BDBASEADDR   /* 0xBF8E2040 */
  .extern SQI1BDSTAT       /* 0xBF8E2044 */
  .extern SQI1BDPOLLCON    /* 0xBF8E2048 */
  .extern SQI1BDTXDSTAT    /* 0xBF8E204C */
  .extern SQI1BDRXDSTAT    /* 0xBF8E2050 */
  .extern SQI1THR          /* 0xBF8E2054 */
  .extern SQI1INTSEN       /* 0xBF8E2058 */
  .extern USBCSR0          /* 0xBF8E3000 */
  .extern USBCSR1          /* 0xBF8E3004 */
  .extern USBCSR2          /* 0xBF8E3008 */
  .extern USBCSR3          /* 0xBF8E300C */
  .extern USBIENCSR1       /* 0xBF8E3014 */
  .extern USBFIFO0         /* 0xBF8E3020 */
  .extern USBFIFO1         /* 0xBF8E3024 */
  .extern USBFIFO2         /* 0xBF8E3028 */
  .extern USBFIFO3         /* 0xBF8E302C */
  .extern USBFIFO4         /* 0xBF8E3030 */
  .extern USBFIFO5         /* 0xBF8E3034 */
  .extern USBFIFO6         /* 0xBF8E3038 */
  .extern USBFIFO7         /* 0xBF8E303C */
  .extern USBOTG           /* 0xBF8E3060 */
  .extern USBFIFOA         /* 0xBF8E3064 */
  .extern USBHWVER         /* 0xBF8E306C */
  .extern USBINFO          /* 0xBF8E3078 */
  .extern USBEOFRST        /* 0xBF8E307C */
  .extern USBE0TXA         /* 0xBF8E3080 */
  .extern USBE0RXA         /* 0xBF8E3084 */
  .extern USBE1TXA         /* 0xBF8E3088 */
  .extern USBE1RXA         /* 0xBF8E308C */
  .extern USBE2TXA         /* 0xBF8E3090 */
  .extern USBE2RXA         /* 0xBF8E3094 */
  .extern USBE3TXA         /* 0xBF8E3098 */
  .extern USBE3RXA         /* 0xBF8E309C */
  .extern USBE4TXA         /* 0xBF8E30A0 */
  .extern USBE4RXA         /* 0xBF8E30A4 */
  .extern USBE5TXA         /* 0xBF8E30A8 */
  .extern USBE5RXA         /* 0xBF8E30AC */
  .extern USBE6TXA         /* 0xBF8E30B0 */
  .extern USBE6RXA         /* 0xBF8E30B4 */
  .extern USBE7TXA         /* 0xBF8E30B8 */
  .extern USBE7RXA         /* 0xBF8E30BC */
  .extern USBE0CSR0        /* 0xBF8E3100 */
  .extern USBE0CSR2        /* 0xBF8E3108 */
  .extern USBE0CSR3        /* 0xBF8E310C */
  .extern USBE1CSR0        /* 0xBF8E3110 */
  .extern USBE1CSR1        /* 0xBF8E3114 */
  .extern USBE1CSR2        /* 0xBF8E3118 */
  .extern USBE1CSR3        /* 0xBF8E311C */
  .extern USBE2CSR0        /* 0xBF8E3120 */
  .extern USBE2CSR1        /* 0xBF8E3124 */
  .extern USBE2CSR2        /* 0xBF8E3128 */
  .extern USBE2CSR3        /* 0xBF8E312C */
  .extern USBE3CSR0        /* 0xBF8E3130 */
  .extern USBE3CSR1        /* 0xBF8E3134 */
  .extern USBE3CSR2        /* 0xBF8E3138 */
  .extern USBE3CSR3        /* 0xBF8E313C */
  .extern USBE4CSR0        /* 0xBF8E3140 */
  .extern USBE4CSR1        /* 0xBF8E3144 */
  .extern USBE4CSR2        /* 0xBF8E3148 */
  .extern USBE4CSR3        /* 0xBF8E314C */
  .extern USBE5CSR0        /* 0xBF8E3150 */
  .extern USBE5CSR1        /* 0xBF8E3154 */
  .extern USBE5CSR2        /* 0xBF8E3158 */
  .extern USBE5CSR3        /* 0xBF8E315C */
  .extern USBE6CSR0        /* 0xBF8E3160 */
  .extern USBE6CSR1        /* 0xBF8E3164 */
  .extern USBE6CSR2        /* 0xBF8E3168 */
  .extern USBE6CSR3        /* 0xBF8E316C */
  .extern USBE7CSR0        /* 0xBF8E3170 */
  .extern USBE7CSR1        /* 0xBF8E3174 */
  .extern USBE7CSR2        /* 0xBF8E3178 */
  .extern USBE7CSR3        /* 0xBF8E317C */
  .extern USBDMAINT        /* 0xBF8E3200 */
  .extern USBDMA1C         /* 0xBF8E3204 */
  .extern USBDMA1A         /* 0xBF8E3208 */
  .extern USBDMA1N         /* 0xBF8E320C */
  .extern USBDMA2C         /* 0xBF8E3214 */
  .extern USBDMA2A         /* 0xBF8E3218 */
  .extern USBDMA2N         /* 0xBF8E321C */
  .extern USBDMA3C         /* 0xBF8E3224 */
  .extern USBDMA3A         /* 0xBF8E3228 */
  .extern USBDMA3N         /* 0xBF8E322C */
  .extern USBDMA4C         /* 0xBF8E3234 */
  .extern USBDMA4A         /* 0xBF8E3238 */
  .extern USBDMA4N         /* 0xBF8E323C */
  .extern USBDMA5C         /* 0xBF8E3244 */
  .extern USBDMA5A         /* 0xBF8E3248 */
  .extern USBDMA5N         /* 0xBF8E324C */
  .extern USBDMA6C         /* 0xBF8E3254 */
  .extern USBDMA6A         /* 0xBF8E3258 */
  .extern USBDMA6N         /* 0xBF8E325C */
  .extern USBDMA7C         /* 0xBF8E3264 */
  .extern USBDMA7A         /* 0xBF8E3268 */
  .extern USBDMA7N         /* 0xBF8E326C */
  .extern USBDMA8C         /* 0xBF8E3274 */
  .extern USBDMA8A         /* 0xBF8E3278 */
  .extern USBDMA8N         /* 0xBF8E327C */
  .extern USBE1RPC         /* 0xBF8E3304 */
  .extern USBE2RPC         /* 0xBF8E3308 */
  .extern USBE3RPC         /* 0xBF8E330C */
  .extern USBE4RPC         /* 0xBF8E3310 */
  .extern USBE5RPC         /* 0xBF8E3314 */
  .extern USBE6RPC         /* 0xBF8E3318 */
  .extern USBE7RPC         /* 0xBF8E331C */
  .extern USBDPBFD         /* 0xBF8E3340 */
  .extern USBTMCON1        /* 0xBF8E3344 */
  .extern USBTMCON2        /* 0xBF8E3348 */
  .extern USBLPMR1         /* 0xBF8E3360 */
  .extern USBLMPR2         /* 0xBF8E3364 */
  .extern USBLPMP2         /* 0xBF8E3364 */
  .extern CEVER            /* 0xBF8E5000 */
  .extern CECON            /* 0xBF8E5004 */
  .extern CEBDADDR         /* 0xBF8E5008 */
  .extern CEBDPADDR        /* 0xBF8E500C */
  .extern CESTAT           /* 0xBF8E5010 */
  .extern CEINTSRC         /* 0xBF8E5014 */
  .extern CEINTEN          /* 0xBF8E5018 */
  .extern CEPOLLCON        /* 0xBF8E501C */
  .extern CEHDLEN          /* 0xBF8E5020 */
  .extern CETRLLEN         /* 0xBF8E5024 */
  .extern RNGVER           /* 0xBF8E6000 */
  .extern RNGCON           /* 0xBF8E6004 */
  .extern RNGPOLY1         /* 0xBF8E6008 */
  .extern RNGPOLY2         /* 0xBF8E600C */
  .extern RNGNUMGEN1       /* 0xBF8E6010 */
  .extern RNGNUMGEN2       /* 0xBF8E6014 */
  .extern RNGSEED1         /* 0xBF8E6018 */
  .extern RNGSEED2         /* 0xBF8E601C */
  .extern RNGCNT           /* 0xBF8E6020 */
  .extern SBFLAG           /* 0xBF8F0510 */
  .extern SBT0ELOG1        /* 0xBF8F8020 */
  .extern SBT0ELOG2        /* 0xBF8F8024 */
  .extern SBT0ECON         /* 0xBF8F8028 */
  .extern SBT0ECLRS        /* 0xBF8F8030 */
  .extern SBT0ECLRM        /* 0xBF8F8038 */
  .extern SBT0REG0         /* 0xBF8F8040 */
  .extern SBT0RD0          /* 0xBF8F8050 */
  .extern SBT0WR0          /* 0xBF8F8058 */
  .extern SBT0REG1         /* 0xBF8F8060 */
  .extern SBT0RD1          /* 0xBF8F8070 */
  .extern SBT0WR1          /* 0xBF8F8078 */
  .extern SBT1ELOG1        /* 0xBF8F8420 */
  .extern SBT1ELOG2        /* 0xBF8F8424 */
  .extern SBT1ECON         /* 0xBF8F8428 */
  .extern SBT1ECLRS        /* 0xBF8F8430 */
  .extern SBT1ECLRM        /* 0xBF8F8438 */
  .extern SBT1REG0         /* 0xBF8F8440 */
  .extern SBT1RD0          /* 0xBF8F8450 */
  .extern SBT1WR0          /* 0xBF8F8458 */
  .extern SBT1REG2         /* 0xBF8F8480 */
  .extern SBT1RD2          /* 0xBF8F8490 */
  .extern SBT1WR2          /* 0xBF8F8498 */
  .extern SBT1REG3         /* 0xBF8F84A0 */
  .extern SBT1RD3          /* 0xBF8F84B0 */
  .extern SBT1WR3          /* 0xBF8F84B8 */
  .extern SBT1REG4         /* 0xBF8F84C0 */
  .extern SBT1RD4          /* 0xBF8F84D0 */
  .extern SBT1WR4          /* 0xBF8F84D8 */
  .extern SBT1REG5         /* 0xBF8F84E0 */
  .extern SBT1RD5          /* 0xBF8F84F0 */
  .extern SBT1WR5          /* 0xBF8F84F8 */
  .extern SBT1REG6         /* 0xBF8F8500 */
  .extern SBT1RD6          /* 0xBF8F8510 */
  .extern SBT1WR6          /* 0xBF8F8518 */
  .extern SBT1REG7         /* 0xBF8F8520 */
  .extern SBT1RD7          /* 0xBF8F8530 */
  .extern SBT1WR7          /* 0xBF8F8538 */
  .extern SBT1REG8         /* 0xBF8F8540 */
  .extern SBT1RD8          /* 0xBF8F8550 */
  .extern SBT1WR8          /* 0xBF8F8558 */
  .extern SBT2ELOG1        /* 0xBF8F8820 */
  .extern SBT2ELOG2        /* 0xBF8F8824 */
  .extern SBT2ECON         /* 0xBF8F8828 */
  .extern SBT2ECLRS        /* 0xBF8F8830 */
  .extern SBT2ECLRM        /* 0xBF8F8838 */
  .extern SBT2REG0         /* 0xBF8F8840 */
  .extern SBT2RD0          /* 0xBF8F8850 */
  .extern SBT2WR0          /* 0xBF8F8858 */
  .extern SBT2REG1         /* 0xBF8F8860 */
  .extern SBT2RD1          /* 0xBF8F8870 */
  .extern SBT2WR1          /* 0xBF8F8878 */
  .extern SBT2REG2         /* 0xBF8F8880 */
  .extern SBT2RD2          /* 0xBF8F8890 */
  .extern SBT2WR2          /* 0xBF8F8898 */
  .extern SBT3ELOG1        /* 0xBF8F8C20 */
  .extern SBT3ELOG2        /* 0xBF8F8C24 */
  .extern SBT3ECON         /* 0xBF8F8C28 */
  .extern SBT3ECLRS        /* 0xBF8F8C30 */
  .extern SBT3ECLRM        /* 0xBF8F8C38 */
  .extern SBT3REG0         /* 0xBF8F8C40 */
  .extern SBT3RD0          /* 0xBF8F8C50 */
  .extern SBT3WR0          /* 0xBF8F8C58 */
  .extern SBT3REG1         /* 0xBF8F8C60 */
  .extern SBT3RD1          /* 0xBF8F8C70 */
  .extern SBT3WR1          /* 0xBF8F8C78 */
  .extern SBT3REG2         /* 0xBF8F8C80 */
  .extern SBT3RD2          /* 0xBF8F8C90 */
  .extern SBT3WR2          /* 0xBF8F8C98 */
  .extern SBT4ELOG1        /* 0xBF8F9020 */
  .extern SBT4ELOG2        /* 0xBF8F9024 */
  .extern SBT4ECON         /* 0xBF8F9028 */
  .extern SBT4ECLRS        /* 0xBF8F9030 */
  .extern SBT4ECLRM        /* 0xBF8F9038 */
  .extern SBT4REG0         /* 0xBF8F9040 */
  .extern SBT4RD0          /* 0xBF8F9050 */
  .extern SBT4WR0          /* 0xBF8F9058 */
  .extern SBT4REG2         /* 0xBF8F9080 */
  .extern SBT4RD2          /* 0xBF8F9090 */
  .extern SBT4WR2          /* 0xBF8F9098 */
  .extern SBT5ELOG1        /* 0xBF8F9420 */
  .extern SBT5ELOG2        /* 0xBF8F9424 */
  .extern SBT5ECON         /* 0xBF8F9428 */
  .extern SBT5ECLRS        /* 0xBF8F9430 */
  .extern SBT5ECLRM        /* 0xBF8F9438 */
  .extern SBT5REG0         /* 0xBF8F9440 */
  .extern SBT5RD0          /* 0xBF8F9450 */
  .extern SBT5WR0          /* 0xBF8F9458 */
  .extern SBT5REG1         /* 0xBF8F9460 */
  .extern SBT5RD1          /* 0xBF8F9470 */
  .extern SBT5WR1          /* 0xBF8F9478 */
  .extern SBT5REG2         /* 0xBF8F9480 */
  .extern SBT5RD2          /* 0xBF8F9490 */
  .extern SBT5WR2          /* 0xBF8F9498 */
  .extern SBT6ELOG1        /* 0xBF8F9820 */
  .extern SBT6ELOG2        /* 0xBF8F9824 */
  .extern SBT6ECON         /* 0xBF8F9828 */
  .extern SBT6ECLRS        /* 0xBF8F9830 */
  .extern SBT6ECLRM        /* 0xBF8F9838 */
  .extern SBT6REG0         /* 0xBF8F9840 */
  .extern SBT6RD0          /* 0xBF8F9850 */
  .extern SBT6WR0          /* 0xBF8F9858 */
  .extern SBT6REG1         /* 0xBF8F9860 */
  .extern SBT6RD1          /* 0xBF8F9870 */
  .extern SBT6WR1          /* 0xBF8F9878 */
  .extern SBT7ELOG1        /* 0xBF8F9C20 */
  .extern SBT7ELOG2        /* 0xBF8F9C24 */
  .extern SBT7ECON         /* 0xBF8F9C28 */
  .extern SBT7ECLRS        /* 0xBF8F9C30 */
  .extern SBT7ECLRM        /* 0xBF8F9C38 */
  .extern SBT7REG0         /* 0xBF8F9C40 */
  .extern SBT7RD0          /* 0xBF8F9C50 */
  .extern SBT7WR0          /* 0xBF8F9C58 */
  .extern SBT7REG1         /* 0xBF8F9C60 */
  .extern SBT7RD1          /* 0xBF8F9C70 */
  .extern SBT7WR1          /* 0xBF8F9C78 */
  .extern SBT8ELOG1        /* 0xBF8FA020 */
  .extern SBT8ELOG2        /* 0xBF8FA024 */
  .extern SBT8ECON         /* 0xBF8FA028 */
  .extern SBT8ECLRS        /* 0xBF8FA030 */
  .extern SBT8ECLRM        /* 0xBF8FA038 */
  .extern SBT8REG0         /* 0xBF8FA040 */
  .extern SBT8RD0          /* 0xBF8FA050 */
  .extern SBT8WR0          /* 0xBF8FA058 */
  .extern SBT8REG1         /* 0xBF8FA060 */
  .extern SBT8RD1          /* 0xBF8FA070 */
  .extern SBT8WR1          /* 0xBF8FA078 */
  .extern SBT9ELOG1        /* 0xBF8FA420 */
  .extern SBT9ELOG2        /* 0xBF8FA424 */
  .extern SBT9ECON         /* 0xBF8FA428 */
  .extern SBT9ECLRS        /* 0xBF8FA430 */
  .extern SBT9ECLRM        /* 0xBF8FA438 */
  .extern SBT9REG0         /* 0xBF8FA440 */
  .extern SBT9RD0          /* 0xBF8FA450 */
  .extern SBT9WR0          /* 0xBF8FA458 */
  .extern SBT9REG1         /* 0xBF8FA460 */
  .extern SBT9RD1          /* 0xBF8FA470 */
  .extern SBT9WR1          /* 0xBF8FA478 */
  .extern SBT10ELOG1       /* 0xBF8FA820 */
